# #!/usr/bin/env python
# # -*- coding: utf-8 -*-
#
# import os
# from suds.client import Client
# code=''
# WS_URL = 'http://11.119.167.201/mimis/services/Entity?wsdl'
# # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# # 1、调试getStringReturnCode接口
# def getNumberAPI(code):
#     client = Client(WS_URL, cache=None)
#     number = client.service.getStringReturnCode(code)
#     return number
#
# # 获取箱号
# # 请求类型|发行库编号|类别|品种
# # 1|北京营管部|黄金|非标准金
# # code = '1|7110000|1000|1700'
# # 返回值：201-1000-1700-2
# # ----------------------------------
# # 获取盒号 有问题？一箱有多盒
# # 请求类型|发行库编号|类别|品种
# # 2|北京营管部|黄金|非标准金
# # code = '2|7110000|1000|1700'
# # 返回值：201-1000-1700-2H
# # ----------------------------------
# # 获取件序号
# # 请求类型|件数
# # code = '3|3'
# # 返回值：1|2|3|
# # ----------------------------------
# # 获取件编号
# # 请求类型|发行库编号|类别|品种|品名|等级|年代|国别|规格|器型
# # 4|北京营管部|黄金|非标准金|锭|稀二级|秦|中国|一两|金牌
# # code = '4|7110000|1000|1700|2|2|2|1|2|2'
# # 返回值：京-1000-1700-2-2-2-1-2-2-1
#
# '''对于没有规格的实物呢？？？'''
# # 4|北京营管部|黄金|非标准金|锭|稀二级|秦|中国||金牌
# # code = '4|7110000|1000|1700|2|2|2|1||2'
# # 返回值：
# '对于没有器型的实物呢？？？'
# # 4|北京营管部|黄金|非标准金|锭|稀二级|秦|中国|一两|
# # code = '4|7110000|1000|1700|2|2|2|1|2|'
# # 返回值：
# '对于没有规格和器型的实物呢？？？'
# # 4|北京营管部|黄金|非标准金|锭|稀二级|秦|中国||
# # code = '4|7110000|1000|1700|2|2|2|1||'
# # 返回值：
#
# # getNumberAPI(code)
#
# # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# # 2、调试postThingDataAPI接口---金银实物清点件接口
# def postThingDataAPI(code):
#     client = Client(WS_URL, cache=None)
#     status_code = client.service.getEntityMessage(code)
#     return status_code
#
# # 推送实物数据
# # 件序号|件编号|是否同质同类标示|类别|品种|品名|等级|名称|年代|年份|器型/型制|面值|
# # 国别|规格|性质|品相|铭文|毛重|原标注成色|仪器检测成色|纯重|件数|长度|宽度|高度|备注
# '是同质同类且是锭类---有规格有型制无性质'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|白银|非标准银|锭|普品|嘎嘎嘎|明|1888-5-2|弧首束腰形|库平七分二厘|
# # 危地马拉|二十五两||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = u'5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|2|5|嘎嘎嘎|10|1888-5-2|6|3|23|5||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '是同质同类且是章类---有性质无规格无型制无面值'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|白银|非标准银|章|珍品|嘎嘎嘎|明|1888-5-2|||
# # 危地马拉||像章|基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|4|1|嘎嘎嘎|10|1888-05-2|||23||3|2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# # 返回值：000
# '是同质同类且是章类' # 件数1错写为1.2会怎样？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|白银|非标准银|章|珍品|嘎嘎嘎|明|1888-5-2|||
# # 危地马拉||像章|基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|4|1|嘎嘎嘎|10|1888-05-2|||23||3|2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# # 返回值：for input string'1.2'
# '是同质同类且是工类---有器型有面值无规格无性质'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|白银|非标准银|工|普品|嘎嘎嘎|明|1888-5-02|宗教用品|库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|3|5|嘎嘎嘎|10|1888-5-02|3|3|23|5||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '是同质同类且是工类'  # 宗教用品应该是3如果写错为33会怎样？？？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|白银|非标准银|工|普品|嘎嘎嘎|明|1888-5-02|宗教用品|库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|3|5|嘎嘎嘎|10|1888-5-02|3|33|23|5||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '是同质同类且是工类'  # 12.001错写为12.001002会怎样？？？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|白银|非标准银|工|普品|嘎嘎嘎|明|1888-5-02|宗教用品|库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|3|5|嘎嘎嘎|10|1888-5-02|3|33|23|5||2|儿童节|12.256|88.8888|98.0000|12.001002|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '是同质同类且是币类---有面值无器型无规格无性质'  # 12.001错写为12.001002会怎样？？？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|黄金|非标准金|币|普品|嘎嘎嘎|明|1888-5-02||库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|1000|1700|1|5|嘎嘎嘎|10|1888-5-02|3|33|23|5||2|儿童节|12.256|88.8888|98.0000|12.001002|1|25.010|0.111|1.002|我varVB？kk4【）=——'
#
# '不是同质同类且是锭类---有规格有型制无性质'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|白银|非标准银|锭|普品|嘎嘎嘎|明|1888-5-2|弧首束腰形|库平七分二厘|
# # 危地马拉|二十五两||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|2|5|嘎嘎嘎|10|1888-5-2|6|3|23|5||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '不是同质同类且是章类---有性质无规格无型制无面值'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|白银|非标准银|章|珍品|嘎嘎嘎|明|1888-5-2|||
# # 危地马拉||像章|基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|2000|2400|4|1|嘎嘎嘎|10|1888-05-2|||23||3|2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# # 返回值：201-1000-1700-2
# # 返回值：201-1000-1700-2
# '不是同质同类且是工类---有器型有面值无规格无性质'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|白银|非标准银|工|普品|嘎嘎嘎|明|1888-5-02|宗教用品|库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|0|2000|2400|3|5|嘎嘎嘎|10|1888-5-02|3|3|23|5||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '不是同质同类且是币类---有面值无器型无规格无性质'  # 12.001错写为12.001002会怎样？？？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|黄金|非标准金|币|普品|嘎嘎嘎|明|1888-5-02||库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|0|1000|1700|1|5|嘎嘎嘎|10|1888-5-02|3|33|23|5||2|儿童节|12.256|88.8888|98.0000|12.001002|1|25.010|0.111|1.002|我varVB？kk4【）=——'
# '不是同质同类且是币类---有面值无器型无规格无性质'  # 88.8888错写为88.88会怎样？？？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|黄金|非标准金|币|普品|嘎嘎嘎|明|1888-5-02||库平七分二厘|
# # 危地马拉|||基本完整|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|我varVB？kk4【）=——
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|0|1000|1700|1|5|嘎嘎嘎|10|1888-5-02|3|33|23|5||2|儿童节|12.256|88.88|98.0000|12.001002|1|25.010|0.111|1.002|我varVB？kk4【）=——'
#
# '待熔类的'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|银元|待熔银元|||名称|年代|年份||||||品相|铭文|毛重|原标注成色|仪器检测成色|纯重|件数|长度|宽度|高度|备注
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|0|3000|3200|||嘎嘎嘎||1888-5-02||||||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|'
# '待熔类的' # 如果是同质同类会怎样？？？
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|1|银元|待熔银元|||嘎嘎嘎||1888-5-02||||||品相|铭文|毛重|原标注成色|仪器检测成色|纯重|件数|长度|宽度|高度|备注
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|1|3000|3200|||嘎嘎嘎||1888-5-02||||||2|儿童节|12.256|88.8888|98.0000|12.001|1|25.010|0.111|1.002|'
#
# '对于零散包'
# # 件序号|京-1000-1700-2-2-2-1-2-2-1|0|银元|待熔银元||稀一级|嘎嘎嘎|4|||日本|||||||原标注成色||||||
# # code = '5|京-1000-1700-2-2-2-1-2-2-1|0|3000|3200||2|嘎嘎嘎||1888-5-02|||6||||||88.8888|||||||'
#
# postThingDataAPI(code)
#
# # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# # 3、调试postCaseAPI接口---金银实物封盒接口
# def postCaseAPI(code):
#     client = Client(WS_URL, cache=None)
#     status_code = client.service.getBoxMessage(code)
#     return status_code
#
# # 推送封盒数据
# # 盒号|类别|品种|封装人|封装复核人|封装时间|件序号
# # 201-1000-1700-2H|银元|待熔银元|封装人|封装复核人|封装时间|件序号
# # code = '201-1000-1700-2H|3000|3200|小李|小红|2016-10-30 12：10:23:4587|2,1,4,5'
# postCaseAPI(code)
#
# # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# # 4、调试postBoxAPI接口---金银实物封盒接口
# def postBoxAPI(code):
#     client = Client(WS_URL, cache=None)
#     status_code = client.service.getPackMessage(code)
#     return status_code
#
# # 推送封箱数据
# # 箱号|类别|品种|盒数|件数|毛重|纯重|原箱号|原箱状态|封装人|封装复核人|封装时间|盒号
#
# # 201-1000-1700-2|银元|待熔银元|4|5|毛重|纯重|原箱号|原箱状态|封装人|封装复核人|封装时间|盒号   有问题！盒号怎么弄？
# # code = '201-1000-1700-2|3000|3200|4|5|1452879.254|125478.256|124-1111-4527-3|1|小李|小红|2016-10-30 12：10:23:4587|201-1000-1700-2H,201-1000-1700-2H
# postBoxAPI(code)
#
# # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# # 5、调试postCaseAPI接口---金银实物封盒接口
# def postPicAPI(filename,filecontent):  # String filename,byte[] filecontent
#     client = Client(WS_URL, cache=None)
#     status_code = client.service.getEntityPicture(filename,filecontent)
#     return status_code
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
